cases/lid_driven_cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: Lid-driven cavity velocity field                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            movingWallVelocity;
        value           uniform (1 0 0);
    }

    bottom
    {
        type            noSlip;
    }

    left
    {
        type            noSlip;
    }

    right
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

