cases/lid_driven_cavity/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: Physical properties for OpenFOAM 11 icoFoam                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

nu              [0 2 -1 0 0 0 0] 0.01;
