cases/lid_driven_cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: Laminar transport properties                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 0.01;

