cases/lid_driven_cavity/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: Centerline sampling configuration                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type            sets;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

interpolationScheme cellPoint;
setFormat       raw;

sets
(
    verticalCenterline
    {
        type    uniform;
        axis    xyz;
        start   (0.5 0 0);
        end     (0.5 1 0);
        nPoints 101;
    }

    horizontalCenterline
    {
        type    uniform;
        axis    xyz;
        start   (0 0.5 0);
        end     (1 0.5 0);
        nPoints 101;
    }
);

fields
(
    U
);

